generated/nova_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns1:erstellePreisAuskunft xmlns:ns1="http://nova.voev.ch/services/v14/preisauskunft">
      <ns1:PreisAuskunftRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:kundenSegmenteGruppieren="false" xsi:type="ns1:VerbindungPreisAuskunftRequest">
        <ns1:clientIdentifier xmlns:ns3="http://nova.voev.ch/services/v14/base" ns3:leistungsVermittler="11" ns3:kanalCode="41" ns3:verkaufsStelle="16437" ns3:vertriebsPunkt="16437" ns3:verkaufsGeraeteId="236"/>
        <ns1:correlationKontext>
          <ns3:correlationId xmlns:ns3="http://nova.voev.ch/services/v14/base">87482634-560b-4da3-b6a1-155c37490fed</ns3:correlationId>
          <ns3:geschaeftsProzessId xmlns:ns3="http://nova.voev.ch/services/v14/base">1781786f-57ba-4e9a-bc29-287e2aa97f9a</ns3:geschaeftsProzessId>
        </ns1:correlationKontext>
        <ns1:angebotsFilter xmlns:ns3="http://nova.voev.ch/services/v14/vertriebsbase" xsi:type="ns3:TaxonomieFilter">
          <ns3:produktTaxonomie>Basistaxonomie</ns3:produktTaxonomie>
          <ns3:taxonomieKlassePfad>
            <ns3:klassenName>Einzelbillette</ns3:klassenName>
          </ns3:taxonomieKlassePfad>
        </ns1:angebotsFilter>
        <ns1:reisender ns1:alter="25" ns1:externeReisendenReferenzId="1234" ns1:reisendenTyp="PERSON"/>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-B422E60B-6DD3-46A6-BCE4-F25DC24F68A4_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8500218" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T19:36:00Z" ns3:ankunftsZeit="2023-04-24T20:03:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="EC" ns3:verkehrsMittelNummer="56"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8500218" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T20:20:00Z" ns3:ankunftsZeit="2023-04-24T20:56:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="539"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-CDF90294-632E-42AE-8D3B-60E8E870FA82_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T20:02:00Z" ns3:ankunftsZeit="2023-04-24T21:02:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="837"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-77207FD9-E92B-406D-9B6C-EFD5CB8AD4DB_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T20:31:00Z" ns3:ankunftsZeit="2023-04-24T21:31:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="737"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-C0D2E8B1-8F99-4F25-8537-A663C8762B92_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T21:02:00Z" ns3:ankunftsZeit="2023-04-24T22:01:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="839"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-CE55D087-A003-4FC2-93AA-C83621EB612D_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T21:31:00Z" ns3:ankunftsZeit="2023-04-24T22:40:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="739"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502119" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
      </ns1:PreisAuskunftRequest>
    </ns1:erstellePreisAuskunft>
  </soapenv:Body>
</soapenv:Envelope>
